tutorials/immersedBoundary/icoFoam/pitzDailyLaminar/constant/differenceFactors_
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "constant";
    object      differenceFactors_;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
29690
(
822.368
1000
822.368
1000
822.368
1000
822.368
1000
...
)
;

boundaryField
{
    pitzDailyIB
    {
        type            calculated;
        value           nonuniform List<scalar> 
542
(
10365.2
6060.61
6060.61
6060.61
6060.61
6060.61
6060.61
6060.61
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
2000
2000
2000
2000
2000
2000
2000
2000
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
1644.74
1644.74
1644.74
1644.74
1644.74
1644.74
1644.74
1644.74
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
1644.74
1644.74
1644.74
1644.74
1644.74
1644.74
1644.74
1644.74
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
250
(
2000
2000
2000
2000
2000
2000
2000
2000
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
